Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendRadius.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarShapeArcReferenceType)
Create a 180-degree bend constraint driven by radius.
paramId:
The Id of a Rebar Shape parameter.
refType:
A choice of rule for measuring the radius.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012